app/views/conversations/_conversation.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
    <h4 class="media-heading">
      <% if User.find(conversation.originator.id).role=="doctor" %>