app/controllers/appointments_controller.rb

  def index
  	received_appointments = current_user.received_appts
  	tmp_appointments = []
  	received_appointments.each do |appointment|
  		tmp = Hash.new
  		user = User.find(appointment.initiator_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]