app/controllers/assets_controller.rb

def index
    if user_signed_in?
      #show folders shared by others
      @being_shared_folders = current_user.shared_folders_by_others

      #show only root folders
      @folders = current_user.folders.roots
      #show only root files
      @assets = current_user.assets.where("folder_id is NULL").order("uploaded_file_file_name desc")
---
SELECT "assets".* FROM "assets" WHERE "assets"."user_id" = ? AND (folder_id is NULL) ORDER BY uploaded_file_file_name desc  [["user_id", 1]]

  def new
  @asset = current_user.assets.new
  if params[:folder_id] #if we want to upload a file inside another folder
   @current_folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

 def create
   puts asset_params.inspect

   @asset = current_user.assets.new(asset_params)

   if @asset.save
---
INSERT INTO "assets" ("user_id", "created_at", "updated_at", "uploaded_file_file_name", "uploaded_file_content_type", "uploaded_file_file_size", "uploaded_file_updated_at", "folder_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

def browse
  #first find the current folder within own folders
  @current_folder = current_user.folders.find_by_id(params[:folder_id])
  @is_this_folder_being_shared = false if @current_folder #just an instance variable to help hiding buttons on View

  #if not found in own folders, find it in being_shared_folders
  if @current_folder.nil?
    folder = Folder.find_by_id(params[:folder_id])

    @current_folder ||= folder if current_user.has_share_access?(folder)
    @is_this_folder_being_shared = true if @current_folder #just an instance variable to help hiding buttons on View

  end

  if @current_folder
       #if under a sub folder, we shouldn't see shared folders
      @being_shared_folders = []

      #getting the folders which are inside this @current_folder
      @folders = @current_folder.children

      #We need to fix this to show files under a specific folder if we are viewing that folder
     # @assets = current_user.assets.order("uploaded_file_file_name desc")
       #show only files under this current folder
      @assets = @current_folder.assets.order("uploaded_file_file_name desc")
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 7], ["id", 3], ["LIMIT", 1]]
SELECT "assets".* FROM "assets" WHERE "assets"."folder_id" = ? ORDER BY uploaded_file_file_name desc  [["folder_id", 3]]

def share

    people = params[:people]

    people.each do |user_id|
      #getting the shared user id right the owner the email has already signed up with ShareBox
      #if not, the field "shared_user_id" will be left nil for now.
      shared_user = User.find(user_id.to_i)

      #save the details in the ShareFolder table
      @shared_folder = current_user.shared_folders.new
      @shared_folder.folder_id = params[:folder_id]
      @shared_folder.shared_email = shared_user.email




      @shared_folder.shared_user_id = shared_user.id if shared_user

      @shared_folder.message = params[:message]
      @shared_folder.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "shared_folders" ("user_id", "shared_email", "shared_user_id", "folder_id", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["shared_email", "user7@user7.com"], ["shared_user_id", 7], ["folder_id", 1], ["message", ""], ["created_at", 2016-12-17 17:47:49 UTC], ["updated_at", 2016-12-17 17:47:49 UTC]]