app/controllers/contacts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "doctor"]]
---
  def index
  	@contacts = current_user.contacts
  	@contacts_physicians = current_user.contacts.where(role: 'doctor')
    @contacts_patients = current_user.contacts.where(role: 'patient')
  	me = Array.new
  	me << current_user
  	# Remove current user and pass the remaining users

    @users_physicians = User.where(role: 'doctor') - me - @contacts

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
 	  user = User.find(params[:id])

UPDATE "users" SET "session_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_id", "2_MX40NTczMzE1Mn5-MTQ4MjAxNjI2MzgxNn5pamRFbGZRbEZWN3FaY0pXbGNIZE02Mjh-UH4"], ["updated_at", 2016-12-17 23:11:03 UTC], ["id", 7]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def create_session
    # Create a new session if dialed via the contact page
    opentok = OpenTok::OpenTok.new(API_OPENTOK[:key], API_OPENTOK[:secret])
    # Create a session id
    session_id = opentok.create_session.session_id
    # Update session id to the current user database
    current_user.session_id = session_id
    current_user.save
    contact = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create_appointment
    @appointment = Appointment.new
    @receiver = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def get_customer
    user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_customer
    puts "================================"
    puts "================================"

    user = User.find(params[:id])