app/controllers/conversations_controller.rb

  def create
    recipients = User.where(id: conversation_params[:recipients])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]