app/controllers/courses_controller.rb

  def index
    @courses = Course.all
    @registrations = current_user.registrations
    puts "========================"
    puts (@registrations.find_by_course_id(1))
---
SELECT "courses".* FROM "courses"
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."user_id" = ? AND "registrations"."course_id" = ? LIMIT ?  [["user_id", 1], ["course_id", 0], ["LIMIT", 1]]

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("course_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", "CIT594"], ["name", "Programming for the web"], ["created_at", 2017-01-21 00:28:34 UTC], ["updated_at", 2017-01-21 00:28:34 UTC]]

  def attend

    registration = Registration.new
    registration.course_id = params[:id]
    registration.user_id = current_user.id
    registration.save
---
INSERT INTO "registrations" ("course_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["course_id", 1], ["user_id", 1], ["created_at", 2017-01-21 01:52:41 UTC], ["updated_at", 2017-01-21 01:52:41 UTC]]

  def start_teaching

    # Create a new session if dialed via the contact page
    opentok = OpenTok::OpenTok.new(API_OPENTOK[:key], API_OPENTOK[:secret])
    # Create a session id
    session_id = opentok.create_session.session_id
    puts "+++++++++++++++++++="
    puts session_id
    puts "++++++++++++++++++++"

    course = Course.find(params[:id])
    course.session_id = session_id
    course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "courses" SET "session_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["session_id", "2_MX40NTc1MzMzMn5-MTQ4NDk2OTA1NDAxMX4wWENrK1hpZXVNSTlHZnRoZkNmczFRTjd-UH4"], ["updated_at", 2017-01-21 03:24:14 UTC], ["id", 2]]

  def webcast

    # opentok = OpenTok::OpenTok.new(API_OPENTOK[:key], API_OPENTOK[:secret])
    # @session_id = current_user.session_id
    # if (@session_id.empty?)
    #   redirect_to(:action => "index")
    # else
    #   @token = opentok.generate_token(@session_id)
    # end
      @user = current_user.first_name + ' ' + current_user.last_name
      @role = current_user.role
      opentok = OpenTok::OpenTok.new(API_OPENTOK[:key], API_OPENTOK[:secret])
    if current_user.role != "patient"

      # Create a session id
      @session_id = opentok.create_session.session_id
      puts "+++++++++++++++++++="
      puts @session_id
      puts "++++++++++++++++++++"

      course = Course.find(params[:id])
      course.session_id = @session_id
      course.save
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "courses" SET "session_id" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["session_id", "1_MX40NTc1MzMzMn5-MTQ4NDk3MDkyMDgwMH55T3dBa1cvdXF1OVdCaUl0YkQxQkVRTUZ-UH4"], ["updated_at", 2017-01-21 03:55:20 UTC], ["id", 2]]

      redirect_to(:action => "index")
    else

      users = Course.find(params[:id]).users
---
SELECT "users".* FROM "users" INNER JOIN "registrations" ON "users"."id" = "registrations"."user_id" WHERE "registrations"."course_id" = ?  [["course_id", 3]]

  def watch
    opentok = OpenTok::OpenTok.new(API_OPENTOK[:key], API_OPENTOK[:secret])
    course = Course.find_by_course_id(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."course_id" = ? LIMIT ?  [["course_id", "CIT593"], ["LIMIT", 1]]