app/controllers/folders_controller.rb

def new
   @folder = current_user.folders.new
   #if there is "folder_id" param, we know that we are under a folder, thus, we will essentially create a subfolder
   if params[:folder_id] #if we want to create a folder inside another folder

     #we still need to set the @current_folder to make the buttons working fine
     @current_folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]

  def edit
    @folder = current_user.folders.find(params[:folder_id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]

def create
   @folder = current_user.folders.new(folder_params)
   if @folder.save
---
INSERT INTO "folders" ("name", "parent_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Thsd"], ["parent_id", 2], ["user_id", 1], ["created_at", 2016-12-17 17:51:20 UTC], ["updated_at", 2016-12-17 17:51:20 UTC]]

  def update
    respond_to do |format|
      if @folder.update(folder_params)
---
UPDATE "folders" SET "name" = ?, "updated_at" = ? WHERE "folders"."id" = ?  [["name", "234f67"], ["updated_at", 2016-12-17 19:48:16 UTC], ["id", 6]]

  def destroy
   @folder = current_user.folders.find(params[:id])
   @parent_folder = @folder.parent #grabbing the parent folder

   #this will destroy the folder along with all the contents inside
   #sub folders will also be deleted too as well as all files inside
   @folder.destroy
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
DELETE FROM "folders" WHERE "folders"."id" = ?  [["id", 7]]

    def set_folder
      @folder = current_user.folders.find(params[:id])
---
SELECT  "folders".* FROM "folders" WHERE "folders"."user_id" = ? AND "folders"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]