app/controllers/mailbox_controller.rb

  def inbox
    @inbox_doctor = mailbox.inbox.select { |conversation| User.find(conversation.originator.id).role=="doctor"}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def sent
    @sent_doctor = mailbox.sentbox.select { |conversation| User.find(conversation.originator.id).role=="doctor"}
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]