app/controllers/pages_controller.rb

DELETE FROM "push_details" WHERE "push_details"."id" = ?  [["id", 1]]
INSERT INTO "push_details" ("user_id", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def add_push_session
  	token = params[:token]
  	pd = PushDetail.new({:token=>token})
  	current_user.push_details.destroy_all
  	current_user.push_details << pd